       IDENTIFICATION DIVISION.
       PROGRAM-ID.              PROGRAM2.
       AUTHOR.                  RUSSELL BRAZELL.
       INSTALLATION.            HOME DESKTOP.
       DATE-WRITTEN.            7/26/2021.
       DATE-COMPILED.           7/26/2021.
       SECURITY.                MICROFOCUS
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.         IBM-370.
       OBJECT-COMPUTER.         IBM-370.
       INPUT-OUTPUT SECTION.    
       FILE-CONTROL.    
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01  EMPLOYEE-REC-N.
        03 EMPLOYEE-TYPE PIC 9(1).
        03 EMPLOYEE-NAME PIC X(20).
        03 EMPLOYEE-SALARY PIC 9(5)V9(2).
        03 EMPLOYEE-NO PIC 9(6).
        03 EMPLOYEE-LEAVING-DATE.
         05 EMPLOYEE-LEAVE-YEAR PIC 9(4).
         05 EMPLOYEE-LEAVE-MONTH PIC 9(2).
         05 EMPLOYEE-LEAVE-DAY PIC 9(2).
        
       LINKAGE SECTION.
       PROCEDURE DIVISION.
      * MAINLINE SECTION.
      *     DISPLAY "My name is XXXXXX"
      *     GOBACK.
       MAINLINE SECTION.
           MOVE SPACES TO EMPLOYEE-REC-N.
           DISPLAY EMPLOYEE-REC-N.
           MOVE ZEROS TO EMPLOYEE-REC-N.
           DISPLAY EMPLOYEE-REC-N.
           MOVE LOW-VALUES TO EMPLOYEE-REC-N.
           DISPLAY EMPLOYEE-REC-N.
           MOVE HIGH-VALUES TO EMPLOYEE-REC-N.
           DISPLAY EMPLOYEE-REC-N.
           MOVE ALL "A" TO EMPLOYEE-REC-N.
           DISPLAY EMPLOYEE-REC-N.
           GOBACK.


