       IDENTIFICATION DIVISION.
       PROGRAM-ID.              PROGRAM2.
       AUTHOR.                  RUSSELL BRAZELL.
       INSTALLATION.            HOME DESKTOP.
       DATE-WRITTEN.            7/26/2021.
       DATE-COMPILED.           7/26/2021.
       SECURITY.                MICROFOCUS
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.         IBM-370.
       OBJECT-COMPUTER.         IBM-370.
       INPUT-OUTPUT SECTION.    
       FILE-CONTROL.    
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01  WS-TIMES 9(2).
       01  WS-FIRST-NUMBER 9(4)V9(2).
       01  WS-SECOND-NUMBER 9(4)V9(2).
       01  WS-RESULT 9(4).
        
       LINKAGE SECTION.
       PROCEDURE DIVISION.
       PERFORM INPUT-SECTION, ADD-SECTION, SHOW-SECTION.
       DISPLAY "ENTER YOUR 1ST NUMBER".
       ACCEPT 
